#### Terraform Format and Style: `success`
#### Terraform Initialization: `success`
#### Terraform Validation: `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan: `success`

<details><summary>Show Plan</summary>

#### stdout
```
module.demo-acm.aws_acm_certificate_validation.cert_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.demo-acm.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:758073318405:certificate/0d28ab53-9865-40f8-ba71-4c9a2f61fc24]
module.clubdoers-com-static-site.data.aws_caller_identity.current: Reading...
data.aws_secretsmanager_secret_version.env: Reading...
module.opsisdead-com-static-site.data.aws_caller_identity.current: Reading...
module.opsisdead-com-static-site.aws_cloudfront_origin_access_control.website: Refreshing state... [id=EI5BYDY2L280W]
module.opsisdead-com-static-site.aws_s3_bucket.website: Refreshing state... [id=opsisdead.com]
module.clubdoers-com-static-site.data.aws_caller_identity.current: Read complete after 0s [id=758073318405]
module.opsisdead-com-static-site.data.aws_caller_identity.current: Read complete after 0s [id=758073318405]
data.aws_secretsmanager_secret_version.env: Read complete after 0s [id=tnlcommunity/static-sites/opsisdead-com|AWSCURRENT]
data.cloudflare_zone.opsisdead-com: Reading...
data.cloudflare_zone.clubdoers-com: Reading...
module.demo-acm.cloudflare_record.validation_records["opsisdead.com"]: Refreshing state... [id=26c2f1cc97289a52d49d98626edb1434]
data.cloudflare_zone.clubdoers-com: Read complete after 0s [id=4ef5e0bed2fb8a42aec443e85b57e282]
data.cloudflare_zone.opsisdead-com: Read complete after 0s [id=72331abd7eb1ccc35674109076a53576]
module.opsisdead-com-static-site.aws_s3_bucket_public_access_block.website: Refreshing state... [id=opsisdead.com]
module.opsisdead-com-static-site.aws_s3_bucket_server_side_encryption_configuration.website: Refreshing state... [id=opsisdead.com]
module.opsisdead-com-static-site.aws_cloudfront_distribution.website: Refreshing state... [id=E3R18J6D97NVB9]
cloudflare_record.opsisdead-com: Refreshing state... [id=f435082d606893f83e6eec9b925a3ada]
module.opsisdead-com-static-site.aws_s3_bucket_policy.website: Refreshing state... [id=opsisdead.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # cloudflare_record.clubdoers-com will be created
  + resource "cloudflare_record" "clubdoers-com" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "clubdoers.com"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 300
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "4ef5e0bed2fb8a42aec443e85b57e282"
    }

  # module.clubdoers-acm.aws_acm_certificate.cert will be created
  + resource "aws_acm_certificate" "cert" {
      + arn                       = (known after apply)
      + domain_name               = "clubdoers.com"
      + domain_validation_options = [
          + {
              + domain_name           = "clubdoers.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "clubdoers.com",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.clubdoers-acm.aws_acm_certificate_validation.cert_validation will be created
  + resource "aws_acm_certificate_validation" "cert_validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.clubdoers-acm.cloudflare_record.validation_records["clubdoers.com"] will be created
  + resource "cloudflare_record" "validation_records" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = (known after apply)
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 300
      + type            = (known after apply)
      + value           = (known after apply)
      + zone_id         = "4ef5e0bed2fb8a42aec443e85b57e282"
    }

  # module.clubdoers-com-static-site.data.aws_iam_policy_document.cloudfront_bucket_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cloudfront_bucket_access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.clubdoers-com-static-site.aws_cloudfront_distribution.website will be created
  + resource "aws_cloudfront_distribution" "website" {
      + aliases                        = [
          + "clubdoers.com",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "clubdoers.com"
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = false

      + custom_error_response {
          + error_caching_min_ttl = 300
          + error_code            = 403
          + response_code         = 200
          + response_page_path    = "/index.html"
        }

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 600
          + max_ttl                = 3600
          + min_ttl                = 0
          + target_origin_id       = "clubdoers.com"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = "clubdoers.com"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn            = (known after apply)
          + cloudfront_default_certificate = false
          + minimum_protocol_version       = "TLSv1.2_2021"
          + ssl_support_method             = "sni-only"
        }
    }

  # module.clubdoers-com-static-site.aws_cloudfront_origin_access_control.website will be created
  + resource "aws_cloudfront_origin_access_control" "website" {
      + description                       = "Managed by Terraform"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "clubdoers.com"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.clubdoers-com-static-site.aws_s3_bucket.website will be created
  + resource "aws_s3_bucket" "website" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "clubdoers.com"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.clubdoers-com-static-site.aws_s3_bucket_policy.website will be created
  + resource "aws_s3_bucket_policy" "website" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.clubdoers-com-static-site.aws_s3_bucket_public_access_block.website will be created
  + resource "aws_s3_bucket_public_access_block" "website" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.clubdoers-com-static-site.aws_s3_bucket_server_side_encryption_configuration.website will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "website" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.demo-acm.aws_acm_certificate.cert will be destroyed
  # (because aws_acm_certificate.cert is not in configuration)
  - resource "aws_acm_certificate" "cert" {
      - arn                       = "arn:aws:acm:us-east-1:758073318405:certificate/0d28ab53-9865-40f8-ba71-4c9a2f61fc24" -> null
      - domain_name               = "opsisdead.com" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "opsisdead.com"
              - resource_record_name  = "_0efda8a76018564337e6b66cae4b4a7a.opsisdead.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_9d04bf35c63accbbabc1a5579d2dce9f.rwqlylxcsp.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:758073318405:certificate/0d28ab53-9865-40f8-ba71-4c9a2f61fc24" -> null
      - key_algorithm             = "RSA_2048" -> null
      - not_after                 = "2024-09-12T23:59:59Z" -> null
      - not_before                = "2023-08-14T00:00:00Z" -> null
      - pending_renewal           = false -> null
      - renewal_eligibility       = "ELIGIBLE" -> null
      - renewal_summary           = [] -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [
          - "opsisdead.com",
        ] -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - type                      = "AMAZON_ISSUED" -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.demo-acm.aws_acm_certificate_validation.cert_validation will be destroyed
  # (because aws_acm_certificate_validation.cert_validation is not in configuration)
  - resource "aws_acm_certificate_validation" "cert_validation" {
      - certificate_arn         = "arn:aws:acm:us-east-1:758073318405:certificate/0d28ab53-9865-40f8-ba71-4c9a2f61fc24" -> null
      - id                      = "0001-01-01 00:00:00 +0000 UTC" -> null
      - validation_record_fqdns = [
          - "_0efda8a76018564337e6b66cae4b4a7a.opsisdead.com",
        ] -> null
    }

  # module.demo-acm.cloudflare_record.validation_records["opsisdead.com"] will be destroyed
  # (because cloudflare_record.validation_records is not in configuration)
  - resource "cloudflare_record" "validation_records" {
      - allow_overwrite = false -> null
      - created_on      = "2023-08-14T02:32:09.743475Z" -> null
      - hostname        = "_0efda8a76018564337e6b66cae4b4a7a.opsisdead.com" -> null
      - id              = "26c2f1cc97289a52d49d98626edb1434" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on     = "2023-08-14T02:32:09.743475Z" -> null
      - name            = "_0efda8a76018564337e6b66cae4b4a7a.opsisdead.com." -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 300 -> null
      - type            = "CNAME" -> null
      - value           = "_9d04bf35c63accbbabc1a5579d2dce9f.rwqlylxcsp.acm-validations.aws" -> null
      - zone_id         = "72331abd7eb1ccc35674109076a53576" -> null
    }

  # module.opsisdead-acm.aws_acm_certificate.cert will be created
  + resource "aws_acm_certificate" "cert" {
      + arn                       = (known after apply)
      + domain_name               = "opsisdead.com"
      + domain_validation_options = [
          + {
              + domain_name           = "opsisdead.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "opsisdead.com",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.opsisdead-acm.aws_acm_certificate_validation.cert_validation will be created
  + resource "aws_acm_certificate_validation" "cert_validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.opsisdead-acm.cloudflare_record.validation_records["opsisdead.com"] will be created
  + resource "cloudflare_record" "validation_records" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = (known after apply)
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 300
      + type            = (known after apply)
      + value           = (known after apply)
      + zone_id         = "72331abd7eb1ccc35674109076a53576"
    }

  # module.opsisdead-com-static-site.data.aws_iam_policy_document.cloudfront_bucket_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "cloudfront_bucket_access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::opsisdead.com/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::758073318405:distribution/E3R18J6D97NVB9",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.opsisdead-com-static-site.aws_cloudfront_distribution.website will be updated in-place
  ~ resource "aws_cloudfront_distribution" "website" {
        id                             = "E3R18J6D97NVB9"
        tags                           = {}
        # (20 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:758073318405:certificate/0d28ab53-9865-40f8-ba71-4c9a2f61fc24" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.opsisdead-com-static-site.aws_s3_bucket_policy.website will be updated in-place
  ~ resource "aws_s3_bucket_policy" "website" {
        id     = "opsisdead.com"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceArn" = "arn:aws:cloudfront::758073318405:distribution/E3R18J6D97NVB9"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::opsisdead.com/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 13 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

#### stderr
```

```

</details>

*Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*